Looks way better with no new change.  Primary changes are here:

```
Terraform will perform the following actions:

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "uat-zOigc4tD-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.eks.aws_iam_role_policy.cluster_elb_sl_role_creation[0] will be destroyed
  - resource "aws_iam_role_policy" "cluster_elb_sl_role_creation" {
      - id          = "uat-zOigc4tD20191216194532063400000001:uat-zOigc4tD-elb-sl-role-creation20201001165320161500000001" -> null
      - name        = "uat-zOigc4tD-elb-sl-role-creation20201001165320161500000001" -> null
      - name_prefix = "uat-zOigc4tD-elb-sl-role-creation" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "uat-zOigc4tD20191216194532063400000001" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "uat-zOigc4tD20191216194532063400000001"
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "uat-zOigc4tD20191216194532063400000001"
    }
```

auth-map changes here:

```
      ~ metadata {
            annotations      = {}
            generation       = 0
          ~ labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
            name             = "aws-auth"
            namespace        = "kube-system"
            resource_version = "75503174"
            self_link        = "/api/v1/namespaces/kube-system/configmaps/aws-auth"
            uid              = "171fc144-21b8-11ea-8c90-061b37c5a04c"
        }
```

It's pretty in line with the changes I saw planning to go to 13.0.0.